//
//  Data.swift
//  TrainingProgram
//
//  Created by MAC User on 6/10/2018.
//  Copyright © 2018 Zhao Ruohan. All rights reserved.
//

import Foundation


class ModelData: NSObject {
    static let shared: ModelData = ModelData()
    public let fontSize = [77,62.5,49,38.5,30.5,24,20,16,12,9,8,6.5,5,4,2.5,2,1.5,1.1,0.9] //40cm :corresponse distance,77\
    public var readingChart = ["我們年紀很小就舉行演奏會","小鳥兒飛到我家屋前的樹上","昨天大表姐到醫院探望叔叔","我在摩天輪上看見藍天白雲","媽媽每天給大文講一個故事","這篇文章描述了新年的景象","小妹妹還沒上學便開始認字","張小華忘記把課室的門關上","大文三歲已經開始創作詩歌","花香引來各種各樣的小昆蟲","打乒乓球是我愛的課外活動","小朋友喜歡坐在旋轉木馬上", "辛勤工作的人應該受到尊重","我學會用重複的句子來作詩","大笨象帶著五隻小河馬過河","姐姐和妹妹要做漂亮的花兒","蜻蜓早就停在荷葉上面休息","車站上的乘客焦急地等待著","小汽車緩慢地穿過這個山洞",
                               
                               "妹妹吃下弟弟幫忙買的餅乾","他在一家電影公司擔任秘書","小貓在畫紙上踩了幾個腳印","木馬是小朋友最喜歡的玩具","沒有人知道這是誰的萬花筒","小明把聽過的故事描述出來","我在動物園裏看到了大笨象","今年我班的足球隊實力很強","他父親叫他寫信給歐陽先生","老鼠冒著生命危險去找食物","他希望在假期裡多參加活動","小朋友最喜歡坐在摩天輪上","他給我們搖來了最平穩的船","一群小螞蟻緩慢地爬上山頂","星期六父親帶弟弟去騎木馬","我在討論中清楚地表達意見","她繼續守護早已長大的孩子","魔術師把大西瓜放在袋子裏","爸爸給我講了這樣一個故事",
                               
                               
                               "哥哥把小狗的腳印變成花朵", "叔叔開車帶我們去郊外遊玩","紫紅色的袋子裏有一張廢紙","小明最喜歡飯後吃一個水果","威風的獵人走到危險的森林","這本書介紹了基本語文知識","猴子在樹上靈活地爬來爬去","小馬帶他走進美麗的大花園","大家輪流介紹自己喜愛的歌","上星期姑姑送給我一盒糖果","李大文可以認識美麗的植物","小美在聽木結他發出的聲音","他獨自守著充滿回憶的房子","小朋友最喜歡上中國武術課","科學家做出一個風車的模型","地上還長著許多紅色的草莓","今年新設計的海報很有創意","故事說出小鳥從小就很勇敢","他們給父母一份特別的驚喜"
        
    ]
    
}
